; domain
(define (domain manito)
    (:requirements :strips)

    (:predicates 
        (en ?bloque ?donde)
        (pos ?garra ?donde)

        (libre ?quien)
        (apilado ?bloque)
        (dismover ?garra)
        (pinned ?garra)

        (torre ?debajo ?sobre)

        (pisog ?garra ?altura)
        (pisob ?bloque ?altura)

        (ocupado ?garra)
        (desocupado ?garra)
        
        (camino ?donde ?hasta)
        (alt ?al1 ?al2))


    (:action movehorizontal
        :parameters (?garra ?donde ?hasta)
        :precondition (and
            (pos ?garra ?donde)
            (camino ?donde ?hasta)
            (dismover ?garra)
        )
        :effect (and
            (pos ?garra ?hasta)
            (not (pos ?garra ?donde))
        )
    )

    (:action moverarriba
        :parameters (?garra ?alt ?alt2)
        :precondition (and
            (pisog ?garra ?alt)
            (alt ?alt ?alt2)
            (pinned ?garra)
        )
        :effect (and
            (pisog ?garra ?alt2)
            (not (pisog ?garra ?alt))
            (not (pinned ?garra))
            (dismover ?garra)
        )
    )

     (:action moverabajo
        :parameters (?garra ?alt ?alt2)
        :precondition (and
            (pisog ?garra ?alt)
            (alt ?alt ?alt2)
            (dismover ?garra)
        )
        :effect (and
            (pisog ?garra ?alt2)
            (not (pisog ?garra ?alt))
            (not (dismover ?garra))
            (pinned ?garra)
        )
    )

    (:action tomar
        :parameters (?garra ?bloque ?donde ?alt)
        :precondition (and
            (pos ?garra ?donde)
            (en ?bloque ?donde)
            (pisog ?garra ?alt)
            (pisob ?bloque ?alt)
            (desocupado ?garra)
            (libre ?bloque)
        )
        :effect (and
            (ocupado ?garra)
            (not (desocupado ?garra))
            (en ?bloque ?garra)
            (not (en ?bloque ?donde))
            (not (pisob ?bloque ?alt))
            (libre ?donde)
            (libre ?bloque)
        )
    )

    (:action soltar 
        :parameters (?garra ?bloque ?donde ?alt)
        :precondition (and
            (pos ?garra ?donde)
            (en ?bloque ?garra)
            (pisog ?garra ?alt)
            (ocupado ?garra)
            (libre ?donde)
        )
        :effect (and
            (not (ocupado ?garra))
            (desocupado ?garra)
            (not (en ?bloque ?garra))
            (en ?bloque ?donde)
            (pisob ?bloque ?alt)
            (not (libre ?donde))
        )
    )

    
    (:action desapilar
        :parameters (?garra ?bloque ?donde ?alt ?bloque2)
        :precondition (and
            (pos ?garra ?donde)
            (en ?bloque ?donde)
            (en ?bloque2 ?donde)

            (pisog ?garra ?alt)
            (pisob ?bloque ?alt)
            (pisob ?bloque2 ?alt)
            
            (desocupado ?garra)

            (libre ?bloque)
            (apilado ?bloque2)
            (torre ?bloque2 ?bloque)
            )
            
            :effect (and
            (not (torre ?bloque2 ?bloque))
            (not (libre ?bloque))
            (not (apilado ?bloque2))
            (libre ?bloque2)
            (ocupado ?garra)
            (not (desocupado ?garra))
            (en ?bloque ?garra)
            (not (en ?bloque ?donde))
            (not (pisob ?bloque ?alt))
            )
    )

    (:action apilar
        :parameters (?garra ?bloque ?bloque2 ?donde ?alt)
        :precondition (and
            (pos ?garra ?donde)
            (en ?bloque ?garra)
            (en ?bloque2 ?donde)

            (pisog ?garra ?alt)
            (pisob ?bloque2 ?alt)
            
            (ocupado ?garra)
            (libre ?bloque2)
            )
            
            :effect (and
            (torre ?bloque2 ?bloque)
            (libre ?bloque)
            (apilado ?bloque2)
            (not (libre ?bloque2))
            (not (ocupado ?garra))
            (desocupado ?garra)
            (not (en ?bloque ?garra))
            (en ?bloque ?donde)
            (pisob ?bloque ?alt)
            )
    )
)

; problem
(define (problem goal8)
    (:domain manito)

    (:objects
        greenb blueb whiteb
        garra
        xygarra xygreen xywhite xydisp1
        zgarra zgreen zwhite zdisp1
    )

    (:init
        (en greenb xygreen)
        (pisob greenb zgreen)
        (apilado greenb)

        (en blueb xygreen)
        (pisob blueb zgreen)
        (libre blueb)

        (torre greenb blueb)

        (en whiteb xywhite)
        (pisob whiteb zwhite)
        (libre whiteb)

        (pos garra xygarra)
        (pisog garra zgarra)

        (dismover garra)
        (desocupado garra)

        (libre xydisp1)

        (camino xygarra xygreen)
        (camino xygreen xygarra)

        (camino xygarra xywhite)
        (camino xywhite xygarra)

        (camino xygreen xydisp1)
        (camino xydisp1 xygreen)

        (camino xywhite xygreen)
        (camino xygreen xywhite)
        
        (camino xywhite xydisp1)
        (camino xydisp1 xywhite)

        (alt zgarra zgreen)
        (alt zgreen zgarra)

        (alt zgarra zwhite)
        (alt zwhite zgarra)

        (alt zgarra zdisp1)
        (alt zdisp1 zgarra)
    )

    (:goal
        (and
            (en blueb xydisp1)
            (pisob blueb zdisp1)
            (torre whiteb greenb)
        )
    )
)

; plan
1. (movehorizontal garra xygarra xygreen)
   deleted: (pos garra xygarra)
   added: (pos garra xygreen)
   goals met: 0 of 3
2. (moverabajo garra zgarra zgreen)
   deleted: (pisog garra zgarra) (dismover garra)
   added: (pisog garra zgreen) (pinned garra)
   goals met: 0 of 3
3. (desapilar garra blueb xygreen zgreen greenb)
   deleted: (torre greenb blueb) (libre blueb) (apilado greenb) (desocupado garra) (en blueb xygreen) (pisob blueb zgreen)
   added: (libre greenb) (ocupado garra) (en blueb garra)
   goals met: 0 of 3
4. (moverarriba garra zgreen zgarra)
   deleted: (pisog garra zgreen) (pinned garra)
   added: (pisog garra zgarra) (dismover garra)
   goals met: 0 of 3
5. (movehorizontal garra xygreen xydisp1)
   deleted: (pos garra xygreen)
   added: (pos garra xydisp1)
   goals met: 0 of 3
6. (moverabajo garra zgarra zdisp1)
   deleted: (pisog garra zgarra) (dismover garra)
   added: (pisog garra zdisp1) (pinned garra)
   goals met: 0 of 3
7. (soltar garra blueb xydisp1 zdisp1)
   deleted: (ocupado garra) (en blueb garra) (libre xydisp1)
   added: (desocupado garra) (en blueb xydisp1) (pisob blueb zdisp1)
   goals met: 2 of 3
8. (moverarriba garra zdisp1 zgarra)
   deleted: (pisog garra zdisp1) (pinned garra)
   added: (pisog garra zgarra) (dismover garra)
   goals met: 2 of 3
9. (movehorizontal garra xydisp1 xygreen)
   deleted: (pos garra xydisp1)
   added: (pos garra xygreen)
   goals met: 2 of 3
10. (moverabajo garra zgarra zgreen)
   deleted: (pisog garra zgarra) (dismover garra)
   added: (pisog garra zgreen) (pinned garra)
   goals met: 2 of 3
11. (tomar garra greenb xygreen zgreen)
   deleted: (desocupado garra) (en greenb xygreen) (pisob greenb zgreen)
   added: (ocupado garra) (en greenb garra) (libre xygreen)
   goals met: 2 of 3
12. (moverarriba garra zgreen zgarra)
   deleted: (pisog garra zgreen) (pinned garra)
   added: (pisog garra zgarra) (dismover garra)
   goals met: 2 of 3
13. (movehorizontal garra xygreen xywhite)
   deleted: (pos garra xygreen)
   added: (pos garra xywhite)
   goals met: 2 of 3
14. (moverabajo garra zgarra zwhite)
   deleted: (pisog garra zgarra) (dismover garra)
   added: (pisog garra zwhite) (pinned garra)
   goals met: 2 of 3
15. (apilar garra greenb whiteb xywhite zwhite)
   deleted: (libre whiteb) (ocupado garra) (en greenb garra)
   added: (torre whiteb greenb) (apilado whiteb) (desocupado garra) (en greenb xywhite) (pisob greenb zwhite)
   goals met: 3 of 3
